# Pivot Tables

In [1]:
import numpy as np
import pandas as pd

   **pd.pivot_table(data,values,index,columns,aggfunc)**

Pandas provides a function ‘pivot_table’ to create MS-Excel spreadsheet style pivot tables.
It can take following arguments:
- data: DataFrame object,
- values: column to aggregate,
- index: row labels,
- columns: column labels,
- aggfunc: aggregation function to be used on values, default is NumPy.mean

In [2]:
df = pd.read_excel('housesales.xlsx')

In [3]:
df.head()

,sqft,hometype,beds,baths,lotsize,yearbulit,daysonmarket,parkingtype,zip,listprice
0,3040,Single Family Residential,4,3,54886,1961,349,1,80303,895.0
1,2920,Single Family Residential,3,3,38754,1966,81,1,80303,659.0
2,3845,Single Family Residential,4,3,46609,2005,19,1,80303,1840.0
3,5588,Single Family Residential,4,5,223463,2008,116,1,80303,6499.0
4,3934,Single Family Residential,4,4,40864,2014,130,1,80305,1500.0

#### 1. Average List Price by Home Type

In [4]:
df.groupby(by='hometype')['listprice'].mean()

hometype
Condo                         588.209946
Single Family Residential    1313.724932
Townhouse                     468.142857
Name: listprice, dtype: float64

In [5]:
pd.pivot_table(data=df,
              values='listprice',
              index='hometype',
              aggfunc='mean')

                             listprice
hometype
Condo                       588.209946
Single Family Residential  1313.724932
Townhouse                   468.142857

In [6]:
pd.pivot_table(data=df,
              values='listprice',
              columns='hometype',
              aggfunc='mean')

hometype        Condo  Single Family Residential   Townhouse
listprice  588.209946                1313.724932  468.142857

#### 2.Average List Price by Home type and Beds

In [7]:
pd.pivot_table(data=df,
              values='listprice',
              index='beds',
              columns='hometype')

hometype        Condo  Single Family Residential   Townhouse
beds
1          293.587867                        NaN         NaN
2          752.761765                1173.214286  437.666667
3         1047.000000                 949.532821  516.333333
4          375.000000                1359.138462  415.000000
5                 NaN                1617.565278         NaN
6                 NaN                1937.741667         NaN

#### 3.Average List Price by Home type and Parking Type

In [8]:
pd.pivot_table(df,values='listprice',index='hometype',columns='parkingtype')

parkingtype                         0            1
hometype
Condo                      185.100000   637.071758
Single Family Residential  886.455556  1362.401190
Townhouse                         NaN   468.142857

#### 4.Average List Price and Sqft by Home type

In [9]:
pd.pivot_table(data=df,
              values=['listprice','sqft'],index='hometype')

                             listprice         sqft
hometype
Condo                       588.209946  1483.162162
Single Family Residential  1313.724932  3520.982955
Townhouse                   468.142857  1579.571429

#### 5.Total of List Price by Zip and Home type and Parking Type

In [15]:
pd.pivot_table(data=df,values='listprice',index='zip',columns=['hometype','parkingtype'],
              aggfunc='sum')

hometype     Condo           Single Family Residential            Townhouse
parkingtype      0         1                         0          1         1
zip
80301          NaN   364.750                     750.0  14050.638     784.0
80302        224.0  8550.150                    6724.9  61056.500     999.0
80303        516.4  4886.499                    1198.9  30560.900     419.0
80304          NaN  7221.969                    5693.5  91866.350     660.0
80305          NaN       NaN                    1588.9  17725.000     415.0

#### 6.Total of List Price by Zip and Home type and Parking Type

We can also fill missing values using the fill_value parameter.

In [16]:
pd.pivot_table(data=df,values='listprice',index='zip',columns=['hometype','parkingtype'],
              aggfunc='sum',fill_value=0)

hometype     Condo           Single Family Residential            Townhouse
parkingtype      0         1                         0          1         1
zip
80301          0.0   364.750                     750.0  14050.638       784
80302        224.0  8550.150                    6724.9  61056.500       999
80303        516.4  4886.499                    1198.9  30560.900       419
80304          0.0  7221.969                    5693.5  91866.350       660
80305          0.0     0.000                    1588.9  17725.000       415

#### 7. Calculate average,total ,min and max listprice by hometype and parkingtype

We can also calculate multiple types of aggregations for any given value column.

In [17]:
pd.pivot_table(data=df,index='hometype',columns='parkingtype',
               values='listprice',
               aggfunc=['mean','sum','min','max'])

                                 mean                   sum              \
parkingtype                         0            1        0           1
hometype
Condo                      185.100000   637.071758    740.4   21023.368
Single Family Residential  886.455556  1362.401190  15956.2  215259.388
Townhouse                         NaN   468.142857      NaN    3277.000

                             min              max
parkingtype                    0        1       0       1
hometype
Condo                      138.5  127.969   224.0  1950.0
Single Family Residential  410.0  319.500  1849.0  7500.0
Townhouse                    NaN  369.000     NaN   660.0

#### 8. Calculate average listprice and min and max values for sqft by hometype

In [23]:
pd.pivot_table(data=df,values=['listprice','sqft'],index='hometype',
              aggfunc={'listprice':'mean',
                      'sqft':['min','max']})

                             listprice   sqft
                                  mean    max   min
hometype
Condo                       588.209946   5888   466
Single Family Residential  1313.724932  10466  1056
Townhouse                   468.142857   2193  1064

In [ ]:
def title(t.lo):
    for ''

In [36]:
df['hometype'].apply(lambda x :x.lower())

0      single family residential
1      single family residential
2      single family residential
3      single family residential
4      single family residential
5      single family residential
6      single family residential
7      single family residential
8      single family residential
9      single family residential
10     single family residential
11     single family residential
12     single family residential
13     single family residential
14     single family residential
15     single family residential
16     single family residential
17     single family residential
18                     townhouse
19     single family residential
20     single family residential
21     single family residential
22     single family residential
23     single family residential
24                         condo
25     single family residential
26     single family residential
27     single family residential
28     single family residential
29                         condo
                 ...
190    single family residential
191    single family residential
192    single family residential
193    single family residential
194    single family residential
195    single family residential
196    single family residential
197    single family residential
198    single family residential
199    single family residential
200    single family residential
201    single family residential
202    single family residential
203    single family residential
204    single family residential
205    single family residential
206    single family residential
207    single family residential
208    single family residential
209    single family residential
210                        condo
211    single family residential
212    single family residential
213    single family residential
214                        condo
215    single family residential
216    single family residential
217    single family residential
218                        condo
219    single family residential
Name: hometype, Length: 220, dtype: object